// ===================================================
// SCENE_Op.h オープニングシーン制御
// 
// hara sougo  2025/09/27
// ===================================================

#ifndef _SCENE_OP_H_
#define _SCENE_OP_H_

#include "../Game/Systems/sys_general.h"

// ==================================================
// 列挙体
// ==================================================

// ===================================================
// プロトタイプ宣言
// ===================================================
void InitializeSceneOp(void);
void UpdateSceneOp(void);
void DrawSceneOp(void);
void FinalizeSceneOp(void);

#endif