// ===================================================
// ui_Game.h ui制御
// 
// hara sougo  2024/12/05
// ===================================================

#ifndef _UI_GAME_H_
#define _UI_GAME_H_


// ===================================================
// 列挙体宣言
// ===================================================
// 
// ===================================================
// 構造体宣言
// ===================================================

// ===================================================
// プロトタイプ宣言
// ===================================================

void InitUI_Game();
void UninitUI_Game();
void UpdateUI_Game();
void DrawUI_Game();

bool ShowHpbar_Game(int index, bool);
bool ShowBossbar_Game(int index, bool, std::string);

int GetBossbarObjIndex_Game();

void UIReset_Game();

#endif