// ===================================================
// ui.h ui制御
// 
// hara sougo  2024/08/21
// ===================================================

#ifndef _UI_H_
#define _UI_H_


// ===================================================
// 列挙体宣言
// ===================================================
enum BOSSBAR_NAME {
	BOSSBAR_NAME_VOID = 0,
};
// 
// ===================================================
// 構造体宣言
// ===================================================

// ===================================================
// プロトタイプ宣言
// ===================================================

void InitUI();
void UninitUI();
void UpdateUI();
void DrawUI();

bool ShowHpbar(int index, bool);
bool ShowBossbar(int index, bool, BOSSBAR_NAME);

bool ShowGameFrame(bool);

void UIReset();

#endif