
/*================================================================================
*
* @file			commonBindings.h
* @author		Sougo Hara
*
* @brief		Description
*
================================================================================*/


//----------------------------------------------------------------------------------
//ここではC++とHLSLの両方で使うことを考慮する
//----------------------------------------------------------------------------------

 //C++のときのみインクルードガードが機能するようにする
#if !defined(_COMMON_BIDINGS_H_) || defined(__hlsl__)
#define _COMMON_BIDINGS_H_

#define ISEKI_DAY_CHANGE_TIME (30.0f)

#ifdef __cplusplus //C++のときのみ定義するもの

#endif // __cplusplus



#endif // _COMMON_BIDINGS_H_ || !__cplusplus
